# Housing Market

merge

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np
from numpy import random

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
ser0= pd.Series(np.random.randint(1,5,size=100))
ser1= pd.Series(np.random.randint(1,4,size=100))
ser2= pd.Series(np.random.randint(10000,30001,size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
df = pd.concat([ser0,ser1,ser2], axis=1)
df

    0  1      2
0   2  1  19309
1   4  3  17786
2   3  3  27477
3   2  3  14523
4   3  1  29265
.. .. ..    ...
95  4  3  11032
96  4  2  22094
97  1  1  22371
98  4  1  22242
99  2  1  20845

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [5]:
df.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'},inplace=True)
df

    bedrs  bathrs  price_sqr_meter
0       2       1            19309
1       4       3            17786
2       3       3            27477
3       2       3            14523
4       3       1            29265
..    ...     ...              ...
95      4       3            11032
96      4       2            22094
97      1       1            22371
98      4       1            22242
99      2       1            20845

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [6]:
bigcolumn = pd.concat([ser0,ser1,ser2], axis=0)
bigcolumn

0         2
1         4
2         3
3         2
4         3
      ...
95    11032
96    22094
97    22371
98    22242
99    20845
Length: 300, dtype: int32

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [8]:
bigcolumn.shape

(300,)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [19]:
bigcolumn.reset_index(drop=True)

0          2
1          4
2          3
3          2
4          3
       ...
295    11032
296    22094
297    22371
298    22242
299    20845
Length: 300, dtype: int32